InformationRegisters/СМГ_ID_Менеджера_Электронная_Очередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СМГ_ID_Менеджера_Электронная_Очередь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВежливости</Name>
					<Comment>Звонок вежливости клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БачатаАвто</Name>
					<Comment>Событие агрегатора Бачата Авто</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОАБР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООАБР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
			<Comment>Виды оплаты</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличныйРасчет</Name>
					<Comment>Наличный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Comment>Безналичный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяОплата</Name>
					<Comment>Произвольная оплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>Состояния событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСообщений</Name>
			<Comment>Типы сообщений документа "Событие"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
					<Comment>Входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
					<Comment>Исходящее сообщение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Comment>Права берутся от другого пользователя, указанного в этом реквизите</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияОборудования</Name>
					<Comment>0 - обычный режим, 1 - локальное оборудование недоступно для других, 2 - запрещено любое использование оборудования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШаблоном</Name>
					<Comment>Является шаблоном</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФункциональнойПанели</Name>
					<Comment>Настройка функциональной панели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФункциональнойПанели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСмит</Name>
					<Comment>Только Ниссан</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСмит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интерфейс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UsGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоменнаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДоменнойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиАРМОтчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиАРМОтчеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/ЭлектроннаяОчередь/Ext/Module.bsl
Функция NewListGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("HI");
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Возврат Ответ;
КонецФункции

Функция New_ListPOST(Запрос)
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON  = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	
	Попытка    
		JSON = ПрочитатьJSON(ЧтениеJSON);
	Исключение 
		Возврат Сформировать_Ответ("Некорректный JSON в теле запроса!",415);
	КонецПопытки;
	
	Если JSON.Свойство("ИД_Отделения") И JSON.ИД_Отделения = "1" Тогда
		Организация           = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282");         // Организация: Престиж Моторс ООО
		ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ001501");            // Подразделение: Группа - Шолохова 235 (CHERY)
	Иначе
		Возврат Сформировать_Ответ("Некорректный JSON! Отсутсвует ID подразделения.",415);
	КонецЕсли;
	
	Если JSON.Свойство("Имя_Клиента") Тогда 
		Имя_Клиента	= JSON.Имя_Клиента;
	Иначе 
		Возврат Сформировать_Ответ("Некорректный JSON! Отсутсвует имя клиента.",415);
	КонецЕсли;
	
	Если JSON.Свойство("Номер_Телефона_Клиента") Тогда 
		Структура_Телефона  = Разбор_Телефона(JSON.Номер_Телефона_Клиента);
	Иначе 
		Возврат Сформировать_Ответ("Некорректный JSON! Отсутсвует номер телефона клиента.",415);
	КонецЕсли;
	
	Если JSON.Свойство("Услуга") Тогда 
		Услуга = JSON.Услуга;
	Иначе 
		Возврат Сформировать_Ответ("Некорректный JSON! Отсутсвует номер телефона клиента.",415);
	КонецЕсли;
	
	Если JSON.Свойство("ИД_Менеджера") И ЗначениеЗаполнено(JSON.ИД_Менеджера) Тогда
		Пользователь = РегистрыСведений.СМГ_ID_Менеджера_Электронная_Очередь.СоздатьНаборЗаписей().Поиск_Менеджера_По_ID(JSON.ИД_Менеджера);
		Если Пользователь <> Справочники.Пользователи.ПустаяСсылка() Тогда
			Сотрудник = Пользователь.Сотрудник;	
		Иначе
			Возврат Сформировать_Ответ("Некорректный JSON! В 1С отсутствует запись с таким ID менеджера.",415);
		КонецЕсли;	
	ИначеЕсли JSON.Свойство("ФИО_Менеджера") И Не ЗначениеЗаполнено(JSON.ФИО_Менеджера) Тогда
		РуководительОтделаПродаж = Найти_Руководителя_Отдела_Продаж(Организация,ПодразделениеКомпании);
		Если ЗначениеЗаполнено(РуководительОтделаПродаж.Пользователь) И ЗначениеЗаполнено(РуководительОтделаПродаж.Сотрудник) Тогда
			Пользователь             = РуководительОтделаПродаж.Пользователь;
			Сотрудник                = РуководительОтделаПродаж.Сотрудник; 
		Иначе
			Возврат Сформировать_Ответ("Некорректный JSON! Отсутсвует ФИО менеджера. Рабочий лист не будет создан.",415);
		КонецЕсли;                                       	                	
	Иначе  
		Возврат Сформировать_Ответ("Некорректный JSON! Отсутсвуют данные менеджера.",415);
	КонецЕсли;
	
	Номер_Талона        = JSON.Номер_Талона;
	Время_Взятия_Талона = СтрокаВДату(JSON.Время_Взятия_Талона);
	Время_Вызова        = СтрокаВДату(JSON.Время_Вызова);  
	
	Ответ = Сформировать_Ответ("Good.",200); 
	Поиск_Создание_Рабочего_Листа(Организация,ПодразделениеКомпании,Структура_Телефона,Услуга,Имя_Клиента,Пользователь,Сотрудник,,Время_Взятия_Талона,Время_Вызова,Ответ);								

	Возврат Ответ;
	
КонецФункции    

Функция Убрать_Лишние_Знаки(Часть_Наименование)
	
	Часть_Наименование = СтрЗаменить(Часть_Наименование,"  "," ");
	Часть_Наименование = СтрЗаменить(Часть_Наименование,","," ");
	Часть_Наименование = СтрЗаменить(Часть_Наименование,"."," ");
    Часть_Наименование = СтрЗаменить(Часть_Наименование,"  ","");
	Часть_Наименование = СтрЗаменить(Часть_Наименование,"-","");
	Часть_Наименование = СтрЗаменить(Часть_Наименование,"(","");
	Часть_Наименование = СтрЗаменить(Часть_Наименование,")","");
	
	Возврат Часть_Наименование;
	
КонецФункции

Функция Разбор_Телефона(Номер_Телефона_Клиента)  
	
	Номер_Телефона_Клиента = Убрать_Лишние_Знаки(Номер_Телефона_Клиента);
	Структура = Новый Структура("КодГорода,КодРегиона,НомерТелефона,ПредставлениеТелефона,Телефон");
	
	Если ЗначениеЗаполнено(Номер_Телефона_Клиента) И СтрДлина(Номер_Телефона_Клиента) = 12 Тогда
		Структура.Телефон       = Номер_Телефона_Клиента;
		Структура.КодГорода     = Сред(Номер_Телефона_Клиента,3,3);
		Структура.КодРегиона    = Лев(Номер_Телефона_Клиента,2);
		Структура.НомерТелефона = Прав(Номер_Телефона_Клиента,7);
		ПредставлениеТелефона   = Структура.КодРегиона + "," + Символы.НПП + Структура.КодГорода + Структура.НомерТелефона; 
		Структура.ПредставлениеТелефона = ПредставлениеТелефона;
		Возврат Структура;
	Иначе 
		Возврат Структура;
	КонецЕсли;	
		
КонецФункции

Функция СтрокаВДату(Знач Значение, ЧастьДаты = Неопределено) Экспорт
	
	НаборЦифр = "1234567890";
	
	Если ТипЗнч(ЧастьДаты) <> Тип("ЧастиДаты") Тогда
		ЧастьДаты = ЧастиДаты.Дата;
	КонецЕсли;
	
	ПараметрыДаты = Новый КвалификаторыДаты(ЧастьДаты);
	ОписаниеТипаДата = Новый ОписаниеТипов("Дата",,, ПараметрыДаты);
	
	Значение = ВРег(СтрСоединить(СтрРазделить(СокрЛП(Значение), Символы.НПП + Символы.ПС + Символы.Таб), " "));
	Результат = ОписаниеТипаДата.ПривестиЗначение(Значение);
	
	Для НомерМесяца = 1 По 12 Цикл
		Значение = СтрЗаменить(Значение, ВРег(Формат(Дата(1, НомерМесяца, 2), "ДФ=MMММ")), Формат(НомерМесяца, "ЧЦ=2; ЧВН="));
		Значение = СтрЗаменить(Значение, ВРег(Формат(Дата(1, НомерМесяца, 2), "ДФ=MMM")), Формат(НомерМесяца, "ЧЦ=2; ЧВН="));
	КонецЦикла;
	
	МассивНеЦифр = СтрРазделить(Значение, НаборЦифр);
	Если МассивНеЦифр.Количество() < 2 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПозицияПервойЦифры = СтрДлина(МассивНеЦифр[0]);
	ПозицияПоследнейЦифры = СтрДлина(Значение) - СтрДлина(МассивНеЦифр[МассивНеЦифр.ВГраница()]);
	Значение = Сред(Значение, ПозицияПервойЦифры, ПозицияПоследнейЦифры - ПозицияПервойЦифры);
	Если ПустаяСтрока(Значение) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗначениеМассивом = СтрРазделить(Значение, " ");
	Элемент = ЗначениеМассивом[ЗначениеМассивом.ВГраница()];
	Если ЗначениеМассивом.Количество() > 1 Тогда
		Если СтрДлина(Элемент) = 2 Или СтрДлина(Элемент) = 4 Тогда
			
			ЭтоТолькоЦифры = СтрРазделить(Элемент, НаборЦифр, Ложь).Количество() = 0;
			Если ЭтоТолькоЦифры Тогда
				ЗначениеДата = Значение;
				ЗначениеВремя = "";
			Иначе
				ЗначениеВремя = Элемент;
				ЗначениеМассивом.Удалить(ЗначениеМассивом.ВГраница());
				ЗначениеДата = СтрСоединить(ЗначениеМассивом, " ");
			КонецЕсли;
		Иначе
			
			ЗначениеВремя = Элемент;
			ЗначениеМассивом.Удалить(ЗначениеМассивом.ВГраница());
			ЗначениеДата = СтрСоединить(ЗначениеМассивом, " ");
		КонецЕсли;
	Иначе
		
		ЭтоТолькоЦифры = СтрРазделить(Элемент, НаборЦифр, Ложь).Количество() = 0;
		Если ЭтоТолькоЦифры Тогда
			
			Результат = ОписаниеТипаДата.ПривестиЗначение(Элемент);
			Если Не ЗначениеЗаполнено(Результат) И СтрДлина(Элемент) = 8 Тогда
				
				ПеревернутаяДата  = Сред(Элемент, 5) + Сред(Элемент, 3, 2) + Лев(Элемент, 2);
				Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
				
			КонецЕсли;
			
			Возврат Результат;
			
		ИначеЕсли СтрНайти(Элемент, ":") > 0 Тогда
			
			ЗначениеДата = "";
			ЗначениеВремя = Элемент;
		Иначе
			ЗначениеДата = Элемент;
			ЗначениеВремя = "";
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	Если ЗначениеЗаполнено(ЗначениеДата) И ЧастьДаты <> ЧастиДаты.Время Тогда
		
		НаборРазделителей = СтрСоединить(СтрРазделить(ЗначениеДата, НаборЦифр, Ложь), "");
		ЗначениеДатаМассивом = СтрРазделить(ЗначениеДата, НаборРазделителей, Ложь);
		
		ЭтоТолькоЦифры = СтрРазделить(ЗначениеДата, НаборЦифр, Ложь).Количество() = 0;
		Если НЕ ЭтоТолькоЦифры Тогда
			
			Год   = 1;
			Месяц = 1;
			День  = 1;
			
			Если СтрДлина(ЗначениеДатаМассивом[0]) = 4 Тогда
				Год = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[0]);
				ГодВНачале = Истина;
			Иначе
				День = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[0]);
				ГодВНачале = Ложь;
			КонецЕсли;
			
			Если ЗначениеДатаМассивом.Количество() = 2 Тогда
				Месяц = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[1]);;
			ИначеЕсли ЗначениеДатаМассивом.Количество() > 2 Тогда
				Месяц = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[1]);
				Если ГодВНачале Тогда
					День = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[2]);
				Иначе
					Год = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеДатаМассивом[2]);
				КонецЕсли;
			КонецЕсли;
			
			Если СтрДлина(Год) < 3 Тогда
				ГодЧислом = ОписаниеТипаЧисло.ПривестиЗначение(Год);
				Год = ?(ГодЧислом < 30, 2000, 1900) + ГодЧислом;
			Иначе
				Год = ОписаниеТипаЧисло.ПривестиЗначение(Год);
			КонецЕсли;
			
			ЗначениеДата = Формат(Год, "ЧЦ=4; ЧН=0001; ЧВН=; ЧГ=0")
				+ Формат(Месяц, "ЧЦ=2; ЧН=01; ЧВН=; ЧГ=0")
				+ Формат(День, "ЧЦ=2; ЧН=01; ЧВН=; ЧГ=0");
		Иначе
			
			Если СтрДлина(ЗначениеДата) = 6 Тогда
				
				Год = Прав(ЗначениеДата, 2);
				ГодЧислом = ОписаниеТипаЧисло.ПривестиЗначение(Год);
				ЗначениеДата = ?(ГодЧислом < 30, 2000, 1900) + Год + Сред(ЗначениеДата, 3, 2) + Лев(ЗначениеДата, 2) ;
				
			ИначеЕсли СтрДлина(ЗначениеДата) = 8 Тогда
				
				Результат = ОписаниеТипаДата.ПривестиЗначение(ЗначениеДата);
				
				Если Не ЗначениеЗаполнено(Результат) Тогда
					ПеревернутаяДата  = Сред(ЗначениеДата, 5) + Сред(ЗначениеДата, 3, 2) + Лев(ЗначениеДата, 2);
					Результат = ОписаниеТипаДата.ПривестиЗначение(ПеревернутаяДата);
					Если ЗначениеЗаполнено(Результат) Тогда
						ЗначениеДата = ПеревернутаяДата;
					КонецЕсли;
				КонецЕсли;
			
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ЗначениеДата = "00010101";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеВремя) И ЧастьДаты <> ЧастиДаты.Дата Тогда
		
		ЭтоТолькоЦифры = СтрРазделить(ЗначениеВремя, НаборЦифр, Ложь).Количество() = 0;
		Если НЕ ЭтоТолькоЦифры Тогда
			
			НаборРазделителей = СтрСоединить(СтрРазделить(ЗначениеВремя, НаборЦифр, Ложь), "");
			ЗначениеВремяМассивом = СтрРазделить(ЗначениеВремя, НаборРазделителей, Ложь);
			
			Час     = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[0]);
			Минута  = 0;
			Секунда = 0;
			
			Если ЗначениеВремяМассивом.Количество() = 2 Тогда
				Минута = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[1]);
			ИначеЕсли ЗначениеВремяМассивом.Количество() > 2 Тогда
				Минута = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[1]);
				Секунда = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеВремяМассивом[2]);
			КонецЕсли;
			
			ШаблонФормата = "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0";
			ЗначениеВремя = Формат(Час, ШаблонФормата)
				+ Формат(Минута, ШаблонФормата)
				+ Формат(Секунда, ШаблонФормата);
				
		КонецЕсли;
		
	Иначе
		ЗначениеВремя = "000000";
	КонецЕсли;
	
	Результат = ОписаниеТипаДата.ПривестиЗначение(ЗначениеДата + ЗначениеВремя);
	
	Возврат Результат;
	
КонецФункции

Функция Сформировать_Ответ(Текст,Код) 
	
	Ответ = Новый HTTPСервисОтвет(Код);
	Ответ.УстановитьТелоИзСтроки(Текст, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ; 
	
КонецФункции

Функция Найти_Руководителя_Отдела_Продаж(Организация,ПодразделениеКомпании)    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Сотрудники.Ссылка = Пользователи.Сотрудник
		|ГДЕ
		|	Сотрудники.Подразделение = &Подразделение
		|	И НЕ Сотрудники.ФлагУволен
		|	И Сотрудники.Должность = &Должность
		|	И Сотрудники.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Должность"    , Справочники.Должности.РуководительОтделаПродажАвтомобилейСПробегом); //ЭТО РУКОВОДИЬЕЛЬ ОТДЕЛА ПРОДАЖ АВТОМОБИЛЕЙ!!!! Не С ПРОБЕГОМ!!!!
	Запрос.УстановитьПараметр("Организация"  , Организация);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Структура = Новый Структура("Сотрудник,Пользователь",Справочники.Сотрудники.ПустаяСсылка(),Справочники.Пользователи.ПустаяСсылка());
	Если РезультатЗапроса.Количество() <> 0 Тогда 
		ЗаполнитьЗначенияСвойств(Структура,РезультатЗапроса[0]);
		Возврат Структура;
	Иначе 
		Возврат Структура
	КОнецЕсли;
		
КонецФункции
	
Процедура Поиск_Создание_Рабочего_Листа(Организация,
	                                    ПодразделениеКомпании,
										Структура_Телефона,
										Услуга,
										Имя_Клиента,
										Пользователь,
										Сотрудник,
										Номер_Талона = "",
	                                    Время_Взятия_Талона,
	                                    Время_Вызова,
	                                    Ответ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочийЛист.Ссылка КАК Ссылка,
		|	РабочийЛист.КодРегиона + РабочийЛист.КодГорода + РабочийЛист.НомерТелефона КАК НомерТелефона,
		|	РабочийЛист.Статус КАК Статус
		|ИЗ
		|	Документ.РабочийЛист КАК РабочийЛист
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РабочийЛист.КодРегиона <> """"
		|				ТОГДА РабочийЛист.КодРегиона + РабочийЛист.КодГорода + РабочийЛист.НомерТелефона = &Телефон
		|			ИНАЧЕ РабочийЛист.ПредставлениеТелефона = &ПредставлениеТелефона
		|		КОНЕЦ
		|	И НЕ РабочийЛист.Статус В
		|				(ВЫБРАТЬ
		|					ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Отказ) КАК Статус
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Продажа)
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.ОшибочныйНомер))
		|	И РабочийЛист.Организация = &Организация
		|	И РабочийЛист.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И РабочийЛист.Проведен
		|	И НЕ РабочийЛист.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочийЛист.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ПредставлениеТелефона", Структура_Телефона.ПредставлениеТелефона);
	Запрос.УстановитьПараметр("Телефон",               Структура_Телефона.Телефон);
	Запрос.УстановитьПараметр("Организация",           Организация);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда   
		Рабочий_Лист = Документы.РабочийЛист.СоздатьДокумент();
		Рабочий_Лист.Организация           = Организация;
		Рабочий_Лист.ПодразделениеКомпании = ПодразделениеКомпании;  
		Рабочий_Лист.Дата                  = ТекущаяДата();
		Рабочий_Лист.Контрагент            = Имя_Клиента;
		Рабочий_Лист.Модель                = Справочники.Модели.НайтиПоКоду("ЦБ00005724");  //CHERY TIGGO7 PRO MAX 
		Рабочий_Лист.Автор                 = Пользователь;
		Рабочий_Лист.Менеджер              = Сотрудник;
		Рабочий_Лист.Пол                   = Перечисления.ПолФизическихЛиц.НеУказан;
		Рабочий_Лист.ВидКонтакта           = Перечисления.ВидыСобытий.ЛичнаяВстреча;
		Рабочий_Лист.ВидОплаты             = Перечисления.ВидыОплаты.НаличныйРасчет;
		Рабочий_Лист.Статус                = Справочники.СтатусыРабочегоЛиста.Интерес;
		ЗаполнитьЗначенияСвойств(Рабочий_Лист,Структура_Телефона);
		
		Попытка
			Рабочий_Лист.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Ответ = Сформировать_Ответ("Некорректный JSON! Рабочий лист не записался.",415);
			Возврат;
		КонецПопытки;
	
		Событие = Документы.Событие.СоздатьДокумент();
		Событие.Организация           = Организация;
		Событие.ПодразделениеКомпании = ПодразделениеКомпании;
		Событие.Дата                  = ТекущаяДата();
		Событие.Тема                  = Услуга;
		Событие.Контрагент            = Имя_Клиента;
		Событие.КонтактноеЛицо        = Справочники.Контрагенты.ПустаяСсылка();
		Событие.ВидСобытия            = Перечисления.ВидыСобытий.ЛичнаяВстреча;
		Событие.Приоритет             = Перечисления.Важность.Средняя;
		Событие.ИсточникИнформации    = Справочники.ИсточникиИнформации.ПустаяСсылка();
		Событие.Состояние             = Перечисления.СостоянияСобытий.Запланировано;
		Событие.ТипСообщения          = Перечисления.ТипыСообщений.Исходящее; 
		Событие.ХозОперация           = Справочники.ХозОперации.Событие;
		Событие.ДокументОснование     = Рабочий_Лист.Ссылка;
		Событие.ДатаНачала            = Время_Вызова;
		Событие.Продавец              = Сотрудник;
		Событие.Автор                 = Пользователь;
		Событие.СозданВ_ЭО            = Истина;
		Событие.Комментарий           = "Создан автоматически из ЭО.";
		ЗаполнитьЗначенияСвойств(Событие,Структура_Телефона);
		Попытка
			Событие.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение
			Ответ = Сформировать_Ответ("Некорректный JSON! Событие к Рабочему листу не записалось.",415);
			Возврат;
		КонецПопытки; 
		
	Иначе    
		
		Ссылка_Рабочий_Лист = РезультатЗапроса[0].Ссылка;
		
		Объект_Рабочий_Лист                          = Ссылка_Рабочий_Лист.ПолучитьОбъект();
		Объект_Рабочий_Лист.ДатаИзменения            = ТекущаяДата();
		Объект_Рабочий_Лист.Менеджер                 = Сотрудник;
		Попытка
			Объект_Рабочий_Лист.Записать(РежимЗаписиДокумента.Запись);
		Исключение
							
		КонецПопытки;

		Событие = Документы.Событие.СоздатьДокумент();
		Событие.Организация           = Организация;
		Событие.ПодразделениеКомпании = ПодразделениеКомпании;
		Событие.Дата                  = ТекущаяДата();
		Событие.Тема                  = Услуга;
		Событие.Контрагент            = Имя_Клиента;
		Событие.КонтактноеЛицо        = Справочники.Контрагенты.ПустаяСсылка();
		Событие.ВидСобытия            = Перечисления.ВидыСобытий.ЛичнаяВстреча;
		Событие.Приоритет             = Перечисления.Важность.Средняя;
		Событие.ИсточникИнформации    = Справочники.ИсточникиИнформации.ПустаяСсылка();
		Событие.Состояние             = Перечисления.СостоянияСобытий.Запланировано;
		Событие.ТипСообщения          = Перечисления.ТипыСообщений.Исходящее; 
		Событие.ХозОперация           = Справочники.ХозОперации.Событие;
		Событие.ДокументОснование     = Ссылка_Рабочий_Лист;
		Событие.ДатаНачала            = Время_Вызова;
		Событие.Продавец              = Сотрудник;
		Событие.Автор                 = Пользователь;
		Событие.СозданВ_ЭО            = Истина;
		Событие.Комментарий           = "Создан автоматически из ЭО.";
		ЗаполнитьЗначенияСвойств(Событие,Структура_Телефона);
		Попытка
			Событие.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение
			Ответ = Сформировать_Ответ("Некорректный JSON! Событие к Рабочему листу не записалось.",415);
			Возврат;
		КонецПопытки; 	
	КонецЕсли;
		
КонецПроцедуры
